export const departmentOptions = [
    { value: '', label: 'เลือกหน่วยงาน' },
    { value: 'สำนักงานคลังเขต 1', label: 'สำนักงานคลังเขต 1' },
    { value: 'สำนักงานคลังเขต 2', label: 'สำนักงานคลังเขต 2' },
    { value: 'สำนักงานคลังเขต 3', label: 'สำนักงานคลังเขต 3' },
    { value: 'สำนักงานคลังเขต 4', label: 'สำนักงานคลังเขต 4' },
    { value: 'สำนักงานคลังเขต 5', label: 'สำนักงานคลังเขต 5' },
    { value: 'สำนักงานคลังเขต 6', label: 'สำนักงานคลังเขต 6' },
    { value: 'สำนักงานคลังเขต 7', label: 'สำนักงานคลังเขต 7' },
    { value: 'สำนักงานคลังเขต 8', label: 'สำนักงานคลังเขต 8' },
    { value: 'สำนักงานคลังเขต 9', label: 'สำนักงานคลังเขต 9' },
    { value: 'สำนักการเงินการคลัง', label: 'สำนักการเงินการคลัง' },
    { value: 'สำนักกฎหมาย', label: 'สำนักกฎหมาย' },
    { value: 'ศูนย์เทคโนโลยีสารสนเทศ', label: 'ศูนย์เทคโนโลยีสารสนเทศ' }
  ];
  
  export const divisionOptions = {
    'ศูนย์เทคโนโลยีสารสนเทศ': [
      { value: 'ฝ่ายบริหารทั่วไป', label: 'ฝ่ายบริหารทั่วไป' },
      { value: 'กลุ่มพัฒนาระบบคอมพิวเตอร์', label: 'กลุ่มพัฒนาระบบคอมพิวเตอร์' },
      { value: 'กลุ่มบริหารจัดการฐานข้อมูล', label: 'กลุ่มบริหารจัดการฐานข้อมูล' },
      { value: 'กลุ่มระบบเครือข่าย', label: 'กลุ่มระบบเครือข่าย' }
    ],
    'สำนักการเงินการคลัง': [
      { value: 'ฝ่ายบริหารทั่วไป', label: 'ฝ่ายบริหารทั่วไป' },
      { value: 'ส่วนการเงิน', label: 'ส่วนการเงิน' },
      { value: 'ส่วนบัญชี', label: 'ส่วนบัญชี' }
    ],
    'สำนักกฎหมาย': [
      { value: 'ฝ่ายบริหารทั่วไป', label: 'ฝ่ายบริหารทั่วไป' },
      { value: 'ส่วนกฎหมายและระเบียบ', label: 'ส่วนกฎหมายและระเบียบ' },
      { value: 'ส่วนคดี', label: 'ส่วนคดี' }
    ],
    'default': [
      { value: 'ฝ่ายบริหารทั่วไป', label: 'ฝ่ายบริหารทั่วไป' },
      { value: 'ส่วนบริหารการคลัง', label: 'ส่วนบริหารการคลัง' },
      { value: 'ส่วนพัฒนาระบบงาน', label: 'ส่วนพัฒนาระบบงาน' }
    ]
  };
  
  export const thaiTitles = [
    { value: '', label: 'เลือกคำนำหน้า' },
    { value: 'นาย', label: 'นาย' },
    { value: 'นาง', label: 'นาง' },
    { value: 'นางสาว', label: 'นางสาว' }
  ];
  
  export const englishTitles = [
    { value: '', label: 'Select Title' },
    { value: 'MR', label: 'MR.' },
    { value: 'MRS', label: 'MRS.' },
    { value: 'MISS', label: 'MISS.' }
  ];